
                /** @type import('wuchale').CompiledElement[] */
export let c = ["تطوير الويب","React / Next.js","TypeScript","Tailwind CSS","WebGL / Three.js","الواجهة الخلفية","Node.js / Go","PostgreSQL","Redis / Kafka","Python / FastAPI","الأدوات","Docker / K8s","Git / CI/CD","Figma Arch","Terraform","الاهتمامات","الشبكات العصبية","أنابيب التكنولوجيا المالية","هندسة SaaS","هندسة تجربة المستخدم","محرك Synthetix","خط أنابيب معالجة ذكاء اصطناعي فوري لتحليل البيانات المالية عالية التردد.","Rust","نظام تشغيل Monolith","نظام تشغيل قائم على المتصفح مبني لسير عمل شديد البساطة والتركيز.","Next.js","Zustand","Krypton UI","نظام مكونات للوحات تحكم التكنولوجيا المالية الثقيلة البيانات مع التركيز على الوضوح.","Storybook","Tailwind","الرسم البياني العصبي","تصور أشجار قرار الذكاء الاصطناعي المعقدة في فضاء ثلاثي الأبعاد باستخدام WebGL.","Three.js","Python","قائد معماري","عمل حر / عن بُعد","بناء أسس SaaS مخصصة للشركات الناشئة في مجال التكنولوجيا المالية في مراحلها المبكرة. التركيز على قابلية التوسع وتجربة المطور.","مهندس Full Stack","شركة Tech Monolith","صيانة البنية التحتية الأساسية لمنصات التجارة الإلكترونية عالية الحركة باستخدام مجموعات تقنية حديثة.","هندسة الحاسوب","المعهد التقني الجامعي","السعي للحصول على درجة علمية مع التركيز على الأنظمة الموزعة وهندسة البرمجيات.","تبديل القائمة","اتصل","محمد علي - مهندس حاسوب","الهوية / 001","م. علي",["السنة الثالثة ",[0,"هندسة حاسوب"]," وباني مستقل. تجارب ويب حديثة، ذكاء اصطناعي، تكنولوجيا مالية، SaaS."],"حالة النظام: نشط","الموقع: 40.7128° شمالاً، 74.0060° غرباً","الفلسفة","النية المعمارية","أتعامل مع الكود ليس فقط كمجموعة من التعليمات، بل كنظام هيكلي. على غرار العمارة الوحشية، يعطي عملي الأولوية للصدق في المواد - مما يعني منطقًا نظيفًا، وهياكل بيانات قوية، وأداءً غير مساوم عليه. كل وحدة هي عنصر حامل في النظام البيئي الرقمي.","الهدف هو التخلص من غير الضروري. من خلال الالتزام بمبادئ الحداثة السويسرية، أقوم بإنشاء واجهات حيث تحدد الطباعة الإيقاع وتوفر المسافات البيضاء الوضوح المطلوب للمهام التقنية المعقدة.","القدرات / الأساسية","الأعمال / المؤشر","شمال_شرق","التسلسل الزمني","الرؤية","\"البساطة هي السلامة الهيكلية القصوى. نحن نبني ليس فقط من أجل الوظيفة، بل من أجل الديمومة في عصر رقمي زائل.\"","الإرسال","بدء الاتصال","اسم المرسل","بريد المرسل","محتوى الرسالة","إرسال الإرسالية","© 2024 تم البناء بواسطة Architectural Monolith. جميع الحقوق محفوظة.","جيثب","لينكدإن","المصدر","Language"]
                // only during dev, for HMR
                let latestVersion = -1
                // @ts-ignore
                export function update({ version, data }) {
                    if (latestVersion >= version) {
                        return
                    }
                    for (const [ index, item ] of data['ar'] ?? []) {
                        c[index] = item
                    }
                    latestVersion = version
                }
            